courses/icv/lectures/车联网安全演练.md



# 车联网安全演练

演练的作用：
- 最重要的是：识别差距，认识到改进方面，以促进整个时间的密切有效的协调
- 相关人员的操作培训
- 对安全策略、过程和应急响应流程进行检查
- 对安全策略、过程和应急响应流程进行压力测试


演练筹备：
- 参与者摸底调研
- 收集利益相关方（各类部门、企业、政府监管）的意见和经验教训
- 对之前演练记录的观察结果进行复盘分析
- 长期存在的漏洞
- 基础设施、演练主要对象的运维情况


通过演练达到的预期效果：
- 提高人们对长期存在或持续存在的漏洞的防范意识，特别是存在于关键联网基础设施中的漏洞。例如：DNS、CA、BGP等。
  - 模拟攻击的方式包括数据破坏（data breaches）、流量拦截（traffic interception）、网站仿冒（website impersionation）、网络钓鱼（phishing）、严重的恶意软件和勒索软件感染。这使我们明白服务的漏洞对网络基础设施和运营的影响程度有多大。而且，参与者还将体验识别和定位一个攻击的难度，突出了灵活的应急处置与协同机制的重要性。
  - 一个简化的攻击模型中，DNS允许用户发现一个特定网站的IP地址；BGP允许用户选择自定义的路由来访问相关的IP地址；CA允许用户通过在两个部分间建立一个信任关系来实现某个IP地址的访问。很多攻击者从网络钓鱼开始，一旦被攻击者获得访问权，他们就能够获得机密数据、泄露机密数据并识别更多的目标。

```xml
<?xml version="1.0"?>
<SOAP-ENV:Envelope 
   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
   SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<SOAP-ENV:Body>
    <m:SetVolume 
        xmlns:m="urn:schemas-upnp-org:service:RenderingControl:1">
        <InstanceID>0</InstanceID>
        <Channel>Master</Channel>
        <DesiredVolume>50</DesiredVolume>
    </m:SetVolume>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope> 
```